ezois_ka/oooezoiskaobmen/src/Documents/УведомлениеОПолучателеДокументов/УведомлениеОПолучателеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОПолучателеДокументов</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсехПодразделений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеЯвноРеквизитовПолучателяДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАбонента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>46</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолучателяДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННПолучателяДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПППолучателяДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательДокументовЯвляетсяФизическимЛицом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФамилияПолучателяДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПолучателяДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчествоПолучателяДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДолжностныеЛицаПолучателяДокументов</name>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Enums/ТипыКонтролирующихОрганов/ТипыКонтролирующихОрганов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтролирующихОрганов</name>
  <enumValues>
    <name>ФНС</name>
  </enumValues>
  <enumValues>
    <name>ПФР</name>
  </enumValues>
  <enumValues>
    <name>ФСС</name>
  </enumValues>
  <enumValues>
    <name>ФСГС</name>
  </enumValues>
  <enumValues>
    <name>ФСРАР</name>
  </enumValues>
  <enumValues>
    <name>РПН</name>
  </enumValues>
  <enumValues>
    <name>УдалитьБанкРоссии</name>
  </enumValues>
  <enumValues>
    <name>ФТС</name>
  </enumValues>
  <enumValues>
    <name>Роструд</name>
  </enumValues>
  <enumValues>
    <name>Минобороны</name>
  </enumValues>
  <enumValues>
    <name>ФАС</name>
  </enumValues>
  <enumValues>
    <name>Минюст</name>
  </enumValues>
  <enumValues>
    <name>РЭЦ</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияЮЛФНС</name>
  </enumValues>
  <enumValues>
    <name>ЦБ</name>
  </enumValues>
  <enumValues>
    <name>ЦПРР</name>
  </enumValues>
  <enumValues>
    <name>Роскомнадзор</name>
  </enumValues>
  <enumValues>
    <name>МВД</name>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen/src/Documents/УведомлениеОПолучателеДокументов/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем КонтекстЭДОКлиент;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Если НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			УчетПоВсемОрганизациям = РегламентированнаяОтчетность.ПолучитьПризнакУчетаПоВсемОрганизациям();
			Элементы.Организация.ТолькоПросмотр = НЕ УчетПоВсемОрганизациям;
			
			ОргПоУмолчанию = РегламентированнаяОтчетность.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
			
			КонтекстЭДОСервер = КонтекстЭДОСервер();
			
			Если ЗначениеЗаполнено(ОргПоУмолчанию)
				И ?(КонтекстЭДОСервер = Неопределено, Истина, КонтекстЭДОСервер.СписокДопустимыхОрганизацийВОбъектахОбмена().Найти(ОргПоУмолчанию) <> Неопределено)
				И ((ЗначениеЗаполнено(ОргПоУмолчанию) И НЕ УчетПоВсемОрганизациям)
				ИЛИ (НЕ ЗначениеЗаполнено(Объект.Организация) И УчетПоВсемОрганизациям И (ЗначениеЗаполнено(ОргПоУмолчанию)))) Тогда
				Объект.Организация = ОргПоУмолчанию;
			КонецЕсли;
			
			СтруктураПараметров = Новый Структура("Организация, РегистрацияВНалоговомОргане");
			ЗаполнитьЗначенияСвойств(СтруктураПараметров, Параметры);
			ЗаполнитьДокументПоСтруктуре(СтруктураПараметров);
			
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПредставлениеЗадатьЯвноПолучателя(ЭтотОбъект);
	
	ЭтоЮридическоеЛицоОтправитель = Неопределено;
	Если Параметры.Ключ.Пустая() И ЗначениеЗаполнено(Объект.Организация) И НЕ ЗначениеЗаполнено(Объект.Получатель) Тогда
		РеквизитыОрганизации = РеквизитыОрганизацииНаСервере(Объект.Организация);
		ЭтоЮридическоеЛицоОтправитель 	= РеквизитыОрганизации.ЭтоЮридическоеЛицо;
		Объект.Получатель 				= РеквизитыОрганизации.РегистрацияВНалоговомОргане;
	КонецЕсли;
	
	Если ЭтоЮридическоеЛицоОтправитель = Неопределено Тогда
		ЭтоЮридическоеЛицоОтправитель = НЕ ЗначениеЗаполнено(Объект.Организация) ИЛИ РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(Объект.Организация);
	КонецЕсли;
	Элементы.ДляВсехПодразделений.Видимость = ЭтоЮридическоеЛицоОтправитель;
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.СкрытьЭлементыФормыПриИспользованииОднойОрганизации(ЭтаФорма, "Организация");
	
	УведомлениеОтправлено = УведомлениеОтправлено(Объект.Ссылка);
	
	УправлениеФормой(ЭтаФорма);
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганами.ОтметитьКакПрочтенное(Объект.Ссылка);
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
	
	ИнициализироватьВыводСтатусовИВажныхСообщений_85();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииПослеПолученияКонтекстаЭДО", ЭтотОбъект);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СохранитьСтатусОтправкиУведомления();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_УведомлениеОПолучателеДокументов",, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если РегламентированнаяОтчетностьКлиент.ЭтоСобытиеЗавершениеОтправки(ИмяСобытия) Тогда
		ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере();	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	РеквизитыОрганизации = РеквизитыОрганизацииНаСервере(Объект.Организация);
	Элементы.ДляВсехПодразделений.Видимость = РеквизитыОрганизации.ЭтоЮридическоеЛицо;
	Объект.Получатель 						= РеквизитыОрганизации.РегистрацияВНалоговомОргане;
	
	ФамилияИмяОтчествоДолжностногоЛицаПредставление = "";
	
	ОпределитьПолучателяДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДляВсехПодразделенийПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	ОпределитьПолучателяДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияДляОтбора = Новый Массив;
	Если Объект.Получатель <> Неопределено Тогда
		РеквизитыПолучателя = РеквизитыРегистрацииВНалоговомОрганеНаСервере(Объект.Получатель);
		ЗначенияДляОтбора.Добавить(Новый Структура("КодНО, КПП", РеквизитыПолучателя.Код, РеквизитыПолучателя.КПП));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("ЗначенияДляОтбора", ЗначенияДляОтбора);
	
	ФормаВыбораНалоговогоОргана = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("ФормаВыбораНалоговогоОргана", ПараметрыФормы, ЭтаФорма);
	
	Если ФормаВыбораНалоговогоОргана.ТаблицаНО.Количество() <> 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПолучательНачалоВыбораЗавершение", ЭтотОбъект);
		ФормаВыбораНалоговогоОргана.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
		ФормаВыбораНалоговогоОргана.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбораНалоговогоОргана.Открыть();
		
	ИначеЕсли Объект.Получатель = Неопределено ИЛИ НЕ ЗначениеЗаполнено(РеквизитыПолучателя.Код) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Код налогового органа необходимо задать в справочнике ""Организации"".'"));
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для выбора инспекции, необходимо завести соответствующую запись в справочнике ""Регистрации в налоговом органе"".'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательДокументовЯвляетсяФизическимЛицомВариантыПриИзменении(Элемент)
	
	Объект.ПолучательДокументовЯвляетсяФизическимЛицом = (ПолучательДокументовЯвляетсяФизическимЛицомВарианты = "1");
	УправлениеФормой(ЭтаФорма);
	ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	Если НЕ ДокументооборотСКОКлиент.ПроверитьИЗаписать(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстЭДОКлиент.ВыгрузитьУведомлениеОПолучателеДокументовВФайл(Объект, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	Если НЕ ДокументооборотСКОКлиент.ПроверитьИЗаписать(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтправкиЗавершение", ЭтотОбъект);
	КонтекстЭДОКлиент.ОтправкаРегламентированногоОтчетаВФНС(Объект.Ссылка, ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект)
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

#КонецОбласти

#Область ПанельОтправкиВКонтролирующиеОрганы

&НаКлиенте
Процедура ОбновитьОтправку(Команда)
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбновитьОтправкуИзПанелиОтправки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПротоколНажатие(Элемент)
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьПротоколИзПанелиОтправки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНеотправленноеИзвещение(Команда)
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОтправитьНеотправленноеИзвещениеИзПанелиОтправки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОтправкиНажатие(Элемент)
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьСостояниеОтправкиИзПанелиОтправки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КритическиеОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьКритическиеОшибкиИзПанелиОтправки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаНаименованиеЭтапаНажатие(Элемент)
	
	ПараметрыИзменения = Новый Структура;
	ПараметрыИзменения.Вставить("Форма", ЭтаФорма);
	ПараметрыИзменения.Вставить("Организация", Объект.Организация);
	ПараметрыИзменения.Вставить("КонтролирующийОрган",
		ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ФНС"));
	ПараметрыИзменения.Вставить("ТекстВопроса", НСтр("ru='Вы уверены, что уведомление уже сдано?'"));
	
	РегламентированнаяОтчетностьКлиент.ИзменитьСтатусОтправки(ПараметрыИзменения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриОткрытииПослеПолученияКонтекстаЭДО(Результат, ДополнительныеПараметры) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) ИЛИ Объект.ЗаданиеЯвноРеквизитовПолучателяДокументов ИЛИ УведомлениеОтправлено Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваПолучателяДокументов = КонтекстЭДОКлиент.СвойстваПолучателяДокументовПоУведомлению(Объект);
	
	Если СвойстваПолучателяДокументов.ЭтоПолучательДокументовИзДоверенности Тогда
		Объект.ЗаданиеЯвноРеквизитовПолучателяДокументов = Истина;
		УстановитьПредставлениеЗадатьЯвноПолучателя(ЭтотОбъект);
	КонецЕсли;
	
	ОпределитьПолучателяДокументов(СвойстваПолучателяДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтправкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ИмяВидаОбъекта = НСтр("ru = 'уведомление'");
	УведомлениеОтправлено = ПослеОтправкиЗавершениеНаСервере();
	
	// Перерисовка статуса отправки в форме Отчетность
	ПараметрыОповещения = Новый Структура(); 
	ПараметрыОповещения.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыОповещения.Вставить("Организация", Объект.Организация);
	Оповестить(РегламентированнаяОтчетностьКлиент.ИмяСобытияЗавершениеОтправки(), ПараметрыОповещения, Объект.Ссылка);
	
	Если Открыта() И УведомлениеОтправлено Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательНачалоВыбораЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		Объект.Получатель = РезультатВыбора.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьПолучателяДокументов(СвойстваПолучателяДокументов = Неопределено, ОповещениеОЗавершении = Неопределено)
	
	ФамилияИмяОтчествоДолжностногоЛица = Неопределено;
	
	ПолучательДокументовНеЗаполнен = (НЕ ЗначениеЗаполнено(Объект.ИдентификаторАбонента)
		И НЕ ЗначениеЗаполнено(Объект.НаименованиеПолучателяДокументов)
		И НЕ ЗначениеЗаполнено(Объект.ИННПолучателяДокументов)
		И НЕ ЗначениеЗаполнено(Объект.КПППолучателяДокументов)
		И НЕ Объект.ПолучательДокументовЯвляетсяФизическимЛицом
		И НЕ ЗначениеЗаполнено(Объект.ФамилияПолучателяДокументов)
		И НЕ ЗначениеЗаполнено(Объект.ИмяПолучателяДокументов)
		И НЕ ЗначениеЗаполнено(Объект.ОтчествоПолучателяДокументов)
		И Объект.ДолжностныеЛицаПолучателяДокументов.Количество() = 0);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ПолучательДокументовНеЗаполнен", ПолучательДокументовНеЗаполнен);
	ДополнительныеПараметры.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	
	Оповещение = Новый ОписаниеОповещения(
		"ОпределитьПолучателяДокументовПослеПоискаСертификатаДляШифрования",
		ЭтотОбъект,
		ДополнительныеПараметры);
	
	Если НЕ УведомлениеОтправлено И ЗначениеЗаполнено(Объект.Организация)
		И ((Объект.ЗаданиеЯвноРеквизитовПолучателяДокументов И ПолучательДокументовНеЗаполнен)
		ИЛИ НЕ ЗначениеЗаполнено(ФамилияИмяОтчествоДолжностногоЛицаПредставление)) Тогда
		
		Если СвойстваПолучателяДокументов = Неопределено Тогда
			СвойстваПолучателяДокументов = КонтекстЭДОКлиент.СвойстваПолучателяДокументовПоУведомлению(Объект);
		КонецЕсли;
		
		Если Объект.ЗаданиеЯвноРеквизитовПолучателяДокументов И ПолучательДокументовНеЗаполнен Тогда
			ЗаполнитьЗначенияСвойств(Объект, СвойстваПолучателяДокументов);
		КонецЕсли;
		
		Если КриптографияЭДКОКлиентСервер.ЭтоЛокальнаяПодпись(СвойстваПолучателяДокументов)
			И ЗначениеЗаполнено(СвойстваПолучателяДокументов.ОтпечатокСертификатаДляШифрования) Тогда
			
			СвойстваСертификатаДляШифроания = Новый Структура("Отпечаток",
				СвойстваПолучателяДокументов.ОтпечатокСертификатаДляШифрования);
			КриптографияЭДКОКлиент.НайтиСертификат(Оповещение, СвойстваСертификатаДляШифроания,, Ложь);
			Возврат;
			
		Иначе
			ФамилияИмяОтчествоДолжностногоЛица = Новый Структура("Фамилия, Имя, Отчество",
				СвойстваПолучателяДокументов.ФамилияДолжностногоЛица,
				СвойстваПолучателяДокументов.ИмяДолжностногоЛица,
				СвойстваПолучателяДокументов.ОтчествоДолжностногоЛица);
		КонецЕсли;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Оповещение, ФамилияИмяОтчествоДолжностногоЛица);
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьПолучателяДокументовПослеПоискаСертификатаДляШифрования(Результат, ДополнительныеПараметры) Экспорт
	
	ПолучательДокументовНеЗаполнен 	= ДополнительныеПараметры.ПолучательДокументовНеЗаполнен;
	ОповещениеОЗавершении 			= ДополнительныеПараметры.ОповещениеОЗавершении;
	
	Если Результат <> Неопределено И Результат.Свойство("Выполнено") Тогда
		ФамилияИмяОтчествоДолжностногоЛица = ?(Результат.Выполнено И Результат.СертификатНайден,
			КонтекстЭДОКлиент.ФамилияИмяОтчествоВладельцаСертификата(Результат.СвойстваСертификата),
			Неопределено);
		
	Иначе
		ФамилияИмяОтчествоДолжностногоЛица = Результат;
	КонецЕсли;
	
	Если ФамилияИмяОтчествоДолжностногоЛица <> Неопределено Тогда
		Если Объект.ЗаданиеЯвноРеквизитовПолучателяДокументов И ПолучательДокументовНеЗаполнен И НЕ УведомлениеОтправлено Тогда
			ДолжностноеЛицоПолучателяДокументов = Объект.ДолжностныеЛицаПолучателяДокументов.Добавить();
			ЗаполнитьЗначенияСвойств(ДолжностноеЛицоПолучателяДокументов, ФамилияИмяОтчествоДолжностногоЛица);
		КонецЕсли;
		
		ФамилияИмяОтчествоДолжностногоЛицаПредставление = СокрЛП(ФамилияИмяОтчествоДолжностногоЛица.Фамилия
			+ " " + ФамилияИмяОтчествоДолжностногоЛица.Имя) + " " + ФамилияИмяОтчествоДолжностногоЛица.Отчество;
	КонецЕсли;
	
	УправлениеФормой(ЭтаФорма);
	ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере();
	
	Если ОповещениеОЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументПоСтруктуре(СтруктураПараметров)
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Организация) Тогда
		Объект.Организация = СтруктураПараметров.Организация;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.РегистрацияВНалоговомОргане) Тогда
		Объект.Получатель = СтруктураПараметров.РегистрацияВНалоговомОргане;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПослеОтправкиЗавершениеНаСервере()
	
	УведомлениеОтправлено = УведомлениеОтправлено(Объект.Ссылка);
	УправлениеФормой(ЭтаФорма);
	ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере();	
	
	Возврат УведомлениеОтправлено;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПрорисоватьСтатус(Форма)
	
	ПараметрыПрорисовкиПанелиОтправки = ДокументооборотСКОВызовСервера.ПараметрыПрорисовкиПанелиОтправки(Форма.Объект.Ссылка, Форма.Объект.Организация, "ФНС");
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПрименитьПараметрыПрорисовкиПанелиОтправки(Форма, ПараметрыПрорисовкиПанелиОтправки);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Элементы.Отправить.Видимость = НЕ Форма.УведомлениеОтправлено;
	Элементы.Записать.ТолькоВоВсехДействиях = Форма.УведомлениеОтправлено;
	
	Элементы.ГруппаПолучательДокументов.Видимость = Объект.ЗаданиеЯвноРеквизитовПолучателяДокументов;
	Элементы.ГруппаЮридическоеЛицо.Видимость = НЕ Объект.ПолучательДокументовЯвляетсяФизическимЛицом;
	Элементы.ГруппаФизическоеЛицо.Видимость = Объект.ПолучательДокументовЯвляетсяФизическимЛицом;
	Элементы.ГруппаДолжностныеЛица.Видимость = Объект.ЗаданиеЯвноРеквизитовПолучателяДокументов;
	
	Элементы.ДолжностныеЛицаПолучателяДокументов.ТолькоПросмотр = Форма.УведомлениеОтправлено;
	
	Если Форма.УведомлениеОтправлено Тогда
		Форма.ЗаданиеЯвноРеквизитовПолучателяДокументовПредставление = ?(НЕ Объект.ЗаданиеЯвноРеквизитовПолучателяДокументов,
			НСтр("ru = 'На учетную запись отправителя уведомления'"),
			НСтр("ru = 'Задать вручную реквизиты получателя документов'"));
		Форма.ПолучательДокументовЯвляетсяФизическимЛицомПредставление = ?(Объект.ПолучательДокументовЯвляетсяФизическимЛицом,
			НСтр("ru = 'Физическое лицо'"),
			НСтр("ru = 'Юридическое лицо'"));
		
		Элементы.Организация.Вид 													= ВидПоляФормы.ПолеНадписи;
		Элементы.ДляВсехПодразделений.Вид 											= ВидПоляФормы.ПолеНадписи;
		Элементы.ДляВсехПодразделений.ПоложениеЗаголовка 							= ПоложениеЗаголовкаЭлементаФормы.Авто;
		Элементы.Получатель.Вид 													= ВидПоляФормы.ПолеНадписи;
		Элементы.ЗаданиеЯвноРеквизитовПолучателяДокументовТумблер.Видимость 		= Ложь;
		Элементы.ЗаданиеЯвноРеквизитовПолучателяДокументовПредставление.Видимость 	= Истина;
		Элементы.ДолжностныеЛицаПолучателяДокументов.ПоложениеКоманднойПанели 		= ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		Элементы.ИдентификаторАбонента.Вид 											= ВидПоляФормы.ПолеНадписи;
		Элементы.ПолучательДокументовЯвляетсяФизическимЛицомВарианты.Видимость 		= Ложь;
		Элементы.ПолучательДокументовЯвляетсяФизическимЛицомПредставление.Видимость = Истина;
		Элементы.НаименованиеПолучателяДокументов.Вид 								= ВидПоляФормы.ПолеНадписи;
		Элементы.НаименованиеПолучателяДокументов.Подсказка							= Объект.НаименованиеПолучателяДокументов;
		Элементы.ИННПолучателяДокументов.Вид 										= ВидПоляФормы.ПолеНадписи;
		Элементы.КПППолучателяДокументов.Вид 										= ВидПоляФормы.ПолеНадписи;
		Элементы.ФамилияПолучателяДокументов.Вид 									= ВидПоляФормы.ПолеНадписи;
		Элементы.ИмяПолучателяДокументов.Вид 										= ВидПоляФормы.ПолеНадписи;
		Элементы.ОтчествоПолучателяДокументов.Вид 									= ВидПоляФормы.ПолеНадписи;
		Элементы.ИННФизическогоЛицаПолучателяДокументов.Вид 						= ВидПоляФормы.ПолеНадписи;
	КонецЕсли;
	
	Если НЕ Объект.ЗаданиеЯвноРеквизитовПолучателяДокументов Тогда
		ЭтоЮрЛицо = Элементы.ДляВсехПодразделений.Видимость;
		
		Если ЭтоЮрЛицо Тогда
			Если Объект.ДляВсехПодразделений Тогда
				ТекстСообщения =
					НСтр("ru = 'После отправки уведомления все входящие сообщения, в том числе требования, от налогового органа будут приходить на учетную запись организации - отправителя уведомления.'");
			Иначе
				ТекстСообщения =
					НСтр("ru = 'После отправки уведомления все входящие сообщения, в том числе требования, по указанной регистрации будут приходить на учетную запись организации - отправителя уведомления.'");
			КонецЕсли;
		Иначе
			ТекстСообщения =
				НСтр("ru = 'После отправки уведомления все входящие сообщения, в том числе требования, от налогового органа будут приходить на учетную запись индивидуального предпринимателя - отправителя уведомления.'");
		КонецЕсли;
	Иначе
		Если Объект.ДляВсехПодразделений Тогда
			ТекстСообщения =
				НСтр("ru = 'После отправки уведомления все входящие сообщения, в том числе требования, от налогового органа будут приходить на заданную учетную запись абонента.'");
		Иначе
			ТекстСообщения =
				НСтр("ru = 'После отправки уведомления все входящие сообщения, в том числе требования, по указанной регистрации будут приходить на заданную учетную запись абонента.'");
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ДекорацияИнформация.Заголовок = ТекстСообщения;
	
	Если НЕ Объект.ЗаданиеЯвноРеквизитовПолучателяДокументов Тогда
		
		Если НЕ Форма.УведомлениеОтправлено Тогда
			Форма.ДолжностноеЛицоПолучателя = ?(ЗначениеЗаполнено(Форма.ФамилияИмяОтчествоДолжностногоЛицаПредставление),
				СокрЛП(Форма.ФамилияИмяОтчествоДолжностногоЛицаПредставление), "");
		Иначе
			Форма.ДолжностноеЛицоПолучателя = "";
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ДекорацияИнформацияДолжностноеЛицо.Видимость = (НЕ Объект.ЗаданиеЯвноРеквизитовПолучателяДокументов);
	
	Элементы.ДолжностноеЛицоПолучателя.Видимость = НЕ Объект.ЗаданиеЯвноРеквизитовПолучателяДокументов И ЗначениеЗаполнено(Форма.ДолжностноеЛицоПолучателя);
	
	Форма.ПолучательДокументовЯвляетсяФизическимЛицомВарианты = ?(Объект.ПолучательДокументовЯвляетсяФизическимЛицом, "1", "0");
	
	ПрорисоватьСтатус(Форма);
	
	Элементы.ОтступПередКомментарием.Видимость = 
		НЕ Элементы.ГруппаДолжностныеЛица.Видимость 
		ИЛИ НЕ Элементы.ГруппаПолучательДокументов.Видимость;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтекстЭДОСервер()
	
	Возврат ДокументооборотСКО.ПолучитьОбработкуЭДО();
	
КонецФункции

&НаСервереБезКонтекста
Функция УведомлениеОтправлено(Ссылка)
	
	СтатусОтправки = КонтекстЭДОСервер().ПолучитьСтатусОтправкиОбъекта(Ссылка);
	
	УведомлениеОтправлено =
		ЗначениеЗаполнено(СтатусОтправки) И СтатусОтправки <> Перечисления.СтатусыОтправки.ВКонверте;
	
	Возврат УведомлениеОтправлено;
	
КонецФункции

&НаСервереБезКонтекста
Функция РеквизитыОрганизацииНаСервере(Организация)
	
	Результат = Новый Структура("ЭтоЮридическоеЛицо, РегистрацияВНалоговомОргане", Истина, Неопределено);
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.ЭтоЮридическоеЛицо = РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(Организация);
	
	Если Результат.ЭтоЮридическоеЛицо Тогда
		СвойстваОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Организация, , "КППЮЛ, КодНО");
		КПП = СокрЛП(СвойстваОрганизации.КППЮЛ);
	Иначе
		СвойстваОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Организация, , "КодНО");
		КПП = "";
	КонецЕсли;
	
	КодНалоговогоОргана = СокрЛП(СвойстваОрганизации.КодНО);
	Результат.РегистрацияВНалоговомОргане = КонтекстЭДОСервер().РегистрацияВИФНСПоОрганизацииИКодуНО(Организация, КодНалоговогоОргана, КПП);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция РеквизитыРегистрацииВНалоговомОрганеНаСервере(РегистрацияВНалоговомОргане)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РегистрацияВНалоговомОргане, "Код, КПП");
	
КонецФункции

&НаСервере
Процедура СохранитьСтатусОтправкиУведомления()
	
	РегламентированнаяОтчетность.СохранитьСтатусОтправкиУведомления(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеЯвноРеквизитовПолучателяДокументовТумблерПриИзменении(Элемент)
	
	Объект.ЗаданиеЯвноРеквизитовПолучателяДокументов = Число(ЗаданиеЯвноРеквизитовПолучателяДокументовТумблер);
	ОпределитьПолучателяДокументов();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеЗадатьЯвноПолучателя(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	Форма.ЗаданиеЯвноРеквизитовПолучателяДокументовТумблер = Строка(Число(Объект.ЗаданиеЯвноРеквизитовПолучателяДокументов));
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьВыводСтатусовИВажныхСообщений_85()

	Если РегламентированнаяОтчетность.ДоступнаПодсистема85() Тогда
		МодульЭДОСКонтролирующимиОрганами = ОбщегоНазначения.ОбщийМодуль("ЭлектронныйДокументооборотСКонтролирующимиОрганами");
		МодульЭДОСКонтролирующимиОрганами.УстановитьРазмещениеНаименованияЭтапаБРО_85(ЭтотОбъект);
		МодульЭДОСКонтролирующимиОрганами.ВывестиСтатусыИВыжныеСообщенияНаФорму_85(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере() Экспорт

	Если РегламентированнаяОтчетность.ДоступнаПодсистема85() Тогда
		МодульЭДОСКонтролирующимиОрганами = ОбщегоНазначения.ОбщийМодуль("ЭлектронныйДокументооборотСКонтролирующимиОрганами");
		МодульЭДОСКонтролирующимиОрганами.ВывестиСтатусыИВыжныеСообщенияНаФорму_85(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДетальноеОписаниеСтатусаПослеВыбора(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если Результат = "ОбновитьОтправку" Тогда
		
		ОбновитьОтправку(Неопределено);
		
	ИначеЕсли Результат = "ГиперссылкаПротокол" Тогда 	
		
		ГиперссылкаПротоколНажатие(Неопределено);
		
	ИначеЕсли Результат = "ЭтапыОтправки" Тогда 	
		
		ЭтапыОтправкиНажатие(Неопределено);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиСтатусыИВыжныеСообщенияНаФорму() Экспорт

	ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаНажатияКнопкиВВажномСообщении(Команда)

	Если Команда.Имя = "ОтправитьНеотправленноеИзвещение" Тогда
		ОтправитьНеотправленноеИзвещение(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаНавигационнойСсылкиВВажномСообщении(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Если НРег(НавигационнаяСсылкаФорматированнойСтроки) = "критическиеошибки" Тогда
		КритическиеОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаЗакрытияВажногоСообщения(Команда)

	МодульКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер");
	МодульКлиентСервер.ЗакрытьВажноеСообщение(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)

	МодульОбщегоНазначенияКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщегоНазначенияКлиент");
	МодульОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда, НавигационнаяСсылка, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти
